x = float(input("Введіть x: "))
y = float(input("Введіть y: "))

if x == 0 and y == 0:
    print("Точка знаходиться в початку координат.")
elif x == 0:
    print("Точка знаходиться на осі Y.")
elif y == 0:
    print("Точка знаходиться на осі X.")
elif x > 0 and y > 0:
    print("Точка знаходиться в першому координатному куті.")
elif x < 0 and y > 0:
    print("Точка знаходиться в другому координатному куті.")
elif x < 0 and y < 0:
    print("Точка знаходиться в третьому координатному куті.")
else:
    print("Точка знаходиться в четвертому координатному куті.")
